In [26]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [27]:
lst = ['A','B','C'] 
s = pd.Series(lst)
s = pd.Series(lst,index=[1,2,3])
s

1    A
2    B
3    C
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [28]:
# change the indexes
s.index = [11, 12, 13]
s

11    A
12    B
13    C
dtype: object

## Q3: Retrieve First and second elements.

In [29]:
s[0:2]

11    A
12    B
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [30]:
newS = pd.Series({14: 'A', 15: 'B'})
s =s.append(newS)
s

/var/folders/pq/y21glnl95s528_3fgwb_qjwr0000gn/T/ipykernel_30852/1210809626.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s =s.append(newS)

11    A
12    B
13    C
14    A
15    B
dtype: object

In [31]:
s.drop_duplicates()

11    A
12    B
13    C
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [33]:
data = { 'ID' : [111 , 222 , 333],
        'Name' :['x','y','z']
       } 
DF = pd.DataFrame(data, columns=[ 'ID' , 'Name'])
DF

    ID Name
0  111    x
1  222    y
2  333    z

## Q6: Read educ_figdp_1_Data.csv file

In [37]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [40]:
edu.loc[90:94]
#loc use the index from 90 - 94 , include the end value

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d

In [39]:
edu[90:94]
##slice use the index from 90 - 93 , not include the end value

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d